#include<stdio.h>
#include<windows.h>


int main(){
	////4.
	//int i= -20;
	//unsigned int j = 10;
	//printf("%d\n", i + j);
	
	////5.
	//unsigned int i;
	//for (i = 9; i >= 0; i--){
	//	printf("%u\n", i);
	//	Sleep(100);
	//}
    
	//7.
	//unsigned char i = 0;
	//for (i = 0; i <= 255; i++){
	//	printf("hello world\n");
	//	Sleep(100);
	//}
	//6.
	char a[1000];
	int i;
	for (i = 0; i < 1000; i++){
		a[i] = -1 - i;
	}
	printf("%d ", strlen(a));
	system("pause");
	return 0;
}

//判断当前机器的字节序
int check_sys(){
	int i = 1;
	return(*(char*)&i); //&i取的是开辟的四个字节中的地址最小的
}
int main(){
	int ret = check_sys();
	if (ret == 1){
		printf("小端\n");
	}
	else{
		printf("大端\n");
	}
	system("pause");
	return 0;
}

//int main(){
//	//整形存储，在计算机中按照补码形式存储
//	//———————————————————————存储———————————————————————
//	//1.补码：
//	// A.无符号数:补码就是它对应的二进制序列
//	// B.有符号数：data——>原码——>反码——>补码
//	//2.原码 VS 反码
//	// 原码：就是对应整形的二进制序列，需要特殊考虑的是符号位。
//	//      最高位是符号位（1——>负数，0——>正数）
//	// 反码：原码符号位不变，其他位进行按位取反
//	// 补码：就是反码+1
//	//正数的原、反、补码都相同
//	//————————————————————————取———————————————————————
//	//1.先看类型，再做决定
//	//2.符号：
//	//   有符号数：按照最高符号位0，1进行解释，分别逆向转化回去
//	//   无符号数：逆向转化回去
//	//    20：     0000 0000 0000 0000 0000 0000 0001 0100
//    //   -10：原码：1000 0000 0000 0000 0000 0000 0000 1010
//	//        反码：1111 1111 1111 1111 1111 1111 1111 0101
//	//		  补码：1111 1111 1111 1111 1111 1111 1111 0110
//	//地址有高地址和低地址之分，数据有高权值和低权值之分
//	//以字节为单位，计算机存储分为：大端存储和小端存储
//	//口诀：小：小，小（小端存储：低权值位放在低地址处）
//	
//	int a = 20;
//	int b = -10;
//
//	char a = 256;
//	//256：0000 0000 0000 0000 0000 0001 0000 0000
//	//0x 00 00 01 00
//	int a = 256;
//
//}

